import os
import webbrowser

import data_transfer
import calculation

# перенос данных из .xlsx
data_transfer.transfer_xlsx('dataset.xlsx')

# создание таблицы с полигонами
data_transfer.create_polygon_table('dataset.db')

print("""
|---------------------------------|
|---------- Задание 1 ------------|
|---------------------------------|
""")
calculation.task1()
print("""
|---------------------------------|
|---------- Задание 2 ------------|
|---------------------------------|
""")
calculation.task2()
print("""
|---------------------------------|
|---------- Задание 3 ------------|
|---------------------------------|
""")
calculation.task3()
print("""
|---------------------------------|
|---------- Задание 4 ------------|
|---------------------------------|
""")
calculation.task4()
print("""
|---------------------------------|
|---------- Задание 5 ------------|
|---------------------------------|
""")
calculation.task5()

url = "http://127.0.0.1:8050/"
webbrowser.open_new(url)
os.system('python App.py')


